## React란

- React는 JavaScript 기반의 UI 라이브러리로서, 복잡한 웹 애플리케이션 개발을 더 쉽고 효율적으로 만들어주는 도구입니다.
- React를 사용하면 가독성이 높은 코드를 작성할 수 있고, 컴포넌트 단위로 개발을 하기 때문에 유지 보수도 쉽습니다.

## React 장점

1. 가독성이 높은 코드 작성: JSX라는 문법을 사용하여 HTML과 JavaScript를 조합해서 작성할 수 있기 때문에 가독성이 높은 코드를 작성할 수 있습니다.

2. 컴포넌트 기반의 개발: React에서는 모든 UI 요소를 컴포넌트 단위로 쪼개서 개발합니다. 이러한 방식으로 UI를 작성하면 코드의 재사용성이 높아지고, 유지 보수가 용이해집니다.

3. 가상 DOM 기반의 렌더링: React는 가상 DOM을 사용하여 UI를 렌더링합니다. 가상 DOM을 사용하면 브라우저에서 실제로 DOM을 조작하는 것보다 훨씬 빠르고 효율적으로 UI를 업데이트할 수 있습니다.

4. 생태계가 활성화되어 있음: React는 Facebook에서 만들어졌으며, 현재는 전 세계적으로 사용되는 많은 회사와 개발자들이 사용하고 있습니다. 이러한 활발한 생태계로 인해 React를 사용하는 개발자들은 많은 지원과 자료를 얻을 수 있습니다.

## Virtual DOM

- React에서 Virtual DOM(가상 DOM)은 React의 핵심 개념 중 하나입니다.
- React의 가상 DOM은 메모리 상에 존재하는 가상의 DOM으로, 브라우저에 실제로 그려지는 DOM과는 별개입니다. React는 가상 DOM을 사용하여 변경된 부분만 브라우저에 적용함으로써 DOM 조작을 최소화하고 성능을 향상시킵니다.
- React에서 컴포넌트의 상태가 변경되면 React는 가상 DOM을 사용하여 새로운 가상 DOM을 만들고, 이전 가상 DOM과 비교하여 변경된 부분만 실제 DOM에 반영합니다. 이를 통해 브라우저에서 DOM 조작이 일어나는 횟수를 최소화하고, 성능을 향상시킵니다.
- React의 가상 DOM은 React의 성능을 크게 향상시키는 데에 큰 역할을 합니다. 또한, 가상 DOM은 React의 생산성을 향상시키는 데에도 큰 역할을 합니다. 예를 들어, 가상 DOM을 사용하면 React에서 템플릿을 사용하지 않고도 HTML과 JavaScript를 함께 작성할 수 있습니다. 이를 통해 React 개발자는 HTML과 JavaScript를 분리하지 않고도 간편하게 컴포넌트를 작성할 수 있습니다.
